tests/com/l7tech/service/resources/dotNetWseSignedRequest2.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action wsu:Id="Id-c52cff4b-6eb4-4ace-9b73-2327cb3c440a">http://warehouse.acme.com/ws/listProducts</wsa:Action><wsa:MessageID wsu:Id="Id-293d0915-8946-4a5e-bf15-cdfd539b1022">uuid:37bc4f4a-c58c-4fa1-a91d-2f27020d26f7</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-30465b9a-590f-4594-8b72-71e4860c2fde"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-46b8ebf0-cdfc-46a0-a0b5-ca81c5df7a15">http://ssgmike.l7tech.com:8080/ssg/soap</wsa:To><wsse:Security soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-4d9baffa-e975-4ef9-aeaf-dfda9e0b7513"><wsu:Created>2004-08-12T20:00:05Z</wsu:Created><wsu:Expires>2004-08-12T20:05:05Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-c6b35331-1c27-4f46-9557-7797259d1d2a">MIIBrTCCARagAwIBAgICAZswDQYJKoZIhvcNAQEFBQAwGzEZMBcGA1UEAxMQRmlzaHkgQ2VydHMgSW5jLjAeFw03MDAxMDEwMDAwMDBaFw0yNTA4MjkwNTAzMzBaMB0xGzAZBgNVBAMTEnNleW1vdXIubDd0ZWNoLmNvbTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAiyS7DOuz5WyihjdUYjgZEHZH0bZ7MRQxV3QxGMDm70ZtGSoV19/1gLubpCIwfjbNOskceUva6zX3xPJlw41ZppGD6/gAhDXxnne2ro/7PbSYTALBmdvv2U1YSa2wqYf5iDkYb3VmamK0qdb9y62EW3md4iNAeka2ZYZDnjPGr80CAwEAATANBgkqhkiG9w0BAQUFAAOBgQCGDBuhCWjoaiR+uvAMO+FKA4OANxJT4lG93S3+EhumZ+9RpArGkcsAUJTb96/IXhSNq7q81M5wO85z7ZRRFNo/ODcJQthzb9bYWj62klhEHQh6JOPzPze8gtXj/Ni21Qr5+dTgDp9y/5RhGrgaBbYKOjeg4voJVkAmjDN1R5482w==</wsse:BinarySecurityToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI="#Id-c52cff4b-6eb4-4ace-9b73-2327cb3c440a"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>/Y1rurCSM8pzuG0tFEwGQ8O4uX0=</DigestValue></Reference><Reference URI="#Id-293d0915-8946-4a5e-bf15-cdfd539b1022"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>z9cy9fIuwWCE8ui6lyK2Zq7smzA=</DigestValue></Reference><Reference URI="#Id-30465b9a-590f-4594-8b72-71e4860c2fde"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>qcuyZjsSMOkSZdpFd2p+FjpHhJA=</DigestValue></Reference><Reference URI="#Id-46b8ebf0-cdfc-46a0-a0b5-ca81c5df7a15"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>nZ10iCgrqRiLxGlLU5ZsEvROiEM=</DigestValue></Reference><Reference URI="#Timestamp-4d9baffa-e975-4ef9-aeaf-dfda9e0b7513"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>PsLOrHuQc0LjpfzD+vTLWv+iHwY=</DigestValue></Reference><Reference URI="#Id-3d7e9d79-0128-432c-9418-4ff26869d648"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>stcaak095TiL469wB+1csq9dOHo=</DigestValue></Reference></SignedInfo><SignatureValue>OlhI9f/zRbjhYvWAU+qWB0rRLT2VH3MmBnwNDdILN6u6MCalHQiUbRQOGKUFyvh1mK97bFOWkEV+pZe0IFzfn6hgLqIVnbZFh251IIKFT/5wk8ru1slJbJXc40co1+C4NvUthfqaNiKqknzQI+3qVycN+ly9aajx5x2XvFCGCF4=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-c6b35331-1c27-4f46-9557-7797259d1d2a" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-3d7e9d79-0128-432c-9418-4ff26869d648"><listProducts xmlns="http://warehouse.acme.com/ws" /></soap:Body></soap:Envelope>